<a href="https://colab.research.google.com/github/honghyelim/ALL_SQL/blob/main/sqlite_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [38]:
import sqlite3

In [39]:
conn = sqlite3.connect("employee.db")
cur = conn.cursor()
#테이블 생성
conn.execute('CREATE TABLE employee_data(id INTEGER, name TEXT, nickname TEXT, department TEXT, employment_date TEXT)')

In [40]:
cur.executemany( 'INSERT INTO employee_data VALUES (?, ?, ?, ?, ?)', 
                [(1001, 'Donghyun', 'SOMJANG', 'Development', '2020-04-01 00:00:00.000'), 
                 (2001, 'Sol', 'Fairy', 'Marketing', '2020-04-01 00:00:00.000'), 
                 (2002, 'Jiyoung', 'Magician', 'Marketing', '2020-04-01 00:00:00.000'),
                 (1002, 'Hyeona', 'Theif', 'Development', '2020-04-01 00:00:00.000'), 
                 (1003, 'Soyoung', 'Chief', 'Development', '2020-04-01 00:00:00.000') ] )

In [41]:
conn.commit()

In [42]:
conn = sqlite3.connect("employee.db")        #employee db에 연결
cur = conn.cursor() 
cur.execute("SELECT * FROM employee_data")   #SELECT 쿼리 실행
rows = cur.fetchall()                        #모든 결과의 행을 리스트로 가져옴
for row in rows: 
  print(row)                                 #한줄씩 실행

(1001, 'Donghyun', 'SOMJANG', 'Development', '2020-04-01 00:00:00.000')
(2001, 'Sol', 'Fairy', 'Marketing', '2020-04-01 00:00:00.000')
(2002, 'Jiyoung', 'Magician', 'Marketing', '2020-04-01 00:00:00.000')
(1002, 'Hyeona', 'Theif', 'Development', '2020-04-01 00:00:00.000')
(1003, 'Soyoung', 'Chief', 'Development', '2020-04-01 00:00:00.000')

In [43]:
#쿼리문 변경하여 원하는 값 가져오기
cur.execute("SELECT name, department FROM employee_data WHERE employee_data.id > 2000")

In [44]:
rows = cur.fetchall()            
for row in rows: 
  print(row)

('Sol', 'Marketing')
('Jiyoung', 'Marketing')

In [45]:
cur.execute("SELECT nickname FROM employee_data WHERE employee_data.name == 'Donghyun'")

In [46]:
cur.fetchall()

[('SOMJANG',)]

In [47]:
#모든 데이터를 DataFrame 형태로 출력하기
import pandas as pd
conn = sqlite3.connect('employee.db')
cur = conn.cursor()
cur.execute("SELECT * FROM employee_data")
rows = cur.fetchall()                             #행 데이터 불러오기
cols = [column[0] for column in cur.description]  #열 이름 가져오기 
data_df = pd.DataFrame.from_records(data = rows, columns = cols)
data_df

     id      name  nickname   department          employment_date
0  1001  Donghyun   SOMJANG  Development  2020-04-01 00:00:00.000
1  2001       Sol     Fairy    Marketing  2020-04-01 00:00:00.000
2  2002   Jiyoung  Magician    Marketing  2020-04-01 00:00:00.000
3  1002    Hyeona     Theif  Development  2020-04-01 00:00:00.000
4  1003   Soyoung     Chief  Development  2020-04-01 00:00:00.000

In [48]:
#Table 삭제 하기
conn = sqlite3.connect("employee.db") 
cur = conn.cursor()
conn.execute('DROP TABLE employee_data')
conn.close()